In [1]:
import pandas as pd
import numpy as np

 ### Reading a CSV file

In [2]:
data=pd.read_csv('weatherAUS.csv')

In [3]:
print(data.head(2))

         Date Location  MinTemp  MaxTemp  Rainfall  Evaporation  Sunshine  \
0  2008-12-01   Albury     13.4     22.9       0.6          NaN       NaN
1  2008-12-02   Albury      7.4     25.1       0.0          NaN       NaN

  WindGustDir  WindGustSpeed WindDir9am  ... Humidity9am  Humidity3pm  \
0           W           44.0          W  ...        71.0         22.0
1         WNW           44.0        NNW  ...        44.0         25.0

   Pressure9am  Pressure3pm  Cloud9am  Cloud3pm  Temp9am  Temp3pm  RainToday  \
0       1007.7       1007.1       8.0       NaN     16.9     21.8         No
1       1010.6       1007.8       NaN       NaN     17.2     24.3         No

   RainTomorrow
0            No
1            No

[2 rows x 23 columns]

### dropping a column

In [4]:
data.drop('Sunshine', inplace=True, axis=1)

In [5]:
print(data.head(2))

         Date Location  MinTemp  MaxTemp  Rainfall  Evaporation WindGustDir  \
0  2008-12-01   Albury     13.4     22.9       0.6          NaN           W
1  2008-12-02   Albury      7.4     25.1       0.0          NaN         WNW

   WindGustSpeed WindDir9am WindDir3pm  ...  Humidity9am  Humidity3pm  \
0           44.0          W        WNW  ...         71.0         22.0
1           44.0        NNW        WSW  ...         44.0         25.0

   Pressure9am  Pressure3pm  Cloud9am  Cloud3pm  Temp9am  Temp3pm  RainToday  \
0       1007.7       1007.1       8.0       NaN     16.9     21.8         No
1       1010.6       1007.8       NaN       NaN     17.2     24.3         No

   RainTomorrow
0            No
1            No

[2 rows x 22 columns]

### concatenate two column

In [6]:
data['Date_Location'] = data.Date + ' ' + data.Location

In [7]:
print(data.head(2))

         Date Location  MinTemp  MaxTemp  Rainfall  Evaporation WindGustDir  \
0  2008-12-01   Albury     13.4     22.9       0.6          NaN           W
1  2008-12-02   Albury      7.4     25.1       0.0          NaN         WNW

   WindGustSpeed WindDir9am WindDir3pm  ...  Humidity3pm  Pressure9am  \
0           44.0          W        WNW  ...         22.0       1007.7
1           44.0        NNW        WSW  ...         25.0       1010.6

   Pressure3pm  Cloud9am  Cloud3pm  Temp9am  Temp3pm  RainToday  RainTomorrow  \
0       1007.1       8.0       NaN     16.9     21.8         No            No
1       1007.8       NaN       NaN     17.2     24.3         No            No

       Date_Location
0  2008-12-01 Albury
1  2008-12-02 Albury

[2 rows x 23 columns]

### Dropping NULL values

In [8]:
data.dropna(inplace=True) #inplace shows the change in original dataframe

In [9]:
print(data.head(2))

            Date Location  MinTemp  MaxTemp  Rainfall  Evaporation  \
6049  2009-01-01    Cobar     17.9     35.2       0.0         12.0
6050  2009-01-02    Cobar     18.4     28.9       0.0         14.8

     WindGustDir  WindGustSpeed WindDir9am WindDir3pm  ...  Humidity3pm  \
6049         SSW           48.0        ENE         SW  ...         13.0
6050           S           37.0        SSE        SSE  ...          8.0

      Pressure9am  Pressure3pm  Cloud9am  Cloud3pm  Temp9am  Temp3pm  \
6049       1006.3       1004.4       2.0       5.0     26.6     33.4
6050       1012.9       1012.1       1.0       1.0     20.3     27.0

      RainToday  RainTomorrow     Date_Location
6049         No            No  2009-01-01 Cobar
6050         No            No  2009-01-02 Cobar

[2 rows x 23 columns]

### changing a column name

In [10]:
data = data.rename(columns={'Rainfall': 'barish'})

In [11]:
print(data.head(2))

            Date Location  MinTemp  MaxTemp  barish  Evaporation WindGustDir  \
6049  2009-01-01    Cobar     17.9     35.2     0.0         12.0         SSW
6050  2009-01-02    Cobar     18.4     28.9     0.0         14.8           S

      WindGustSpeed WindDir9am WindDir3pm  ...  Humidity3pm  Pressure9am  \
6049           48.0        ENE         SW  ...         13.0       1006.3
6050           37.0        SSE        SSE  ...          8.0       1012.9

      Pressure3pm  Cloud9am  Cloud3pm  Temp9am  Temp3pm  RainToday  \
6049       1004.4       2.0       5.0     26.6     33.4         No
6050       1012.1       1.0       1.0     20.3     27.0         No

      RainTomorrow     Date_Location
6049            No  2009-01-01 Cobar
6050            No  2009-01-02 Cobar

[2 rows x 23 columns]

### creating dataframe having location and Average Minimum and Average Maximum temperatures

In [12]:
data_1 = pd.DataFrame({"loc":data['Location'],
                      "min":data['MinTemp'],
                      "max":data['MaxTemp']
                      })

In [13]:
data_1

              loc   min   max
6049        Cobar  17.9  35.2
6050        Cobar  18.4  28.9
6052        Cobar  19.4  37.6
6053        Cobar  21.9  38.4
6054        Cobar  24.2  41.0
...           ...   ...   ...
143181  Katherine  18.2  35.5
143182  Katherine  22.6  33.6
143183  Katherine  17.4  30.7
143185  Katherine  13.3  32.0
143186  Katherine  13.0  32.0

[61981 rows x 3 columns]

In [14]:
data_1.groupby("loc").mean()

                        min        max
loc
AliceSprings      13.949508  29.648652
Bendigo            9.004450  21.351545
Brisbane          16.402767  26.466733
Cairns            21.133826  29.518690
Canberra           7.739276  20.371403
Cobar             13.155417  25.714819
CoffsHarbour      14.505263  23.865610
Darwin            23.166895  32.558080
Hobart             8.952410  17.766308
Katherine         20.513957  35.031595
Melbourne         11.673249  20.590258
MelbourneAirport   9.958840  20.494437
Mildura           10.883015  24.899625
Moree             12.833691  26.868357
MountGambier       8.940822  19.991181
NorfolkIsland     16.856120  21.792005
Nuriootpa          9.699902  22.031854
Perth             13.071056  25.187822
PerthAirport      12.682276  25.603291
Portland           9.646951  17.210831
Richmond          14.942282  23.940268
Sale               8.597770  20.416080
Sydney            15.027412  23.454882
SydneyAirport     14.890676  23.422981
Townsville        20.551959  29.408706
WaggaWagga         9.910232  23.208815
Watsonia          10.188100  20.993189
Williamtown       12.980946  24.319711
Woomera           13.372502  26.358135